In [1]:
# Notebook for date-time formating from original dataset
# We will create two additional columns with datetime in US and EU format

In [8]:
import pandas as pd

In [3]:
df_es=pd.read_csv('ES.csv', header=0, names=['date','time','open','max','min','close','volume'])
df_es.head(10)

         date   time     open      max      min    close  volume
0  09/27/2009  18:15  1043.75  1044.00  1043.50  1043.75     631
1  09/27/2009  18:30  1043.75  1044.00  1043.50  1043.50     177
2  09/27/2009  18:45  1043.75  1043.75  1043.50  1043.75     180
3  09/27/2009  19:00  1043.75  1043.75  1040.25  1041.50    3017
4  09/27/2009  19:15  1041.50  1041.50  1040.00  1040.75    1232
5  09/27/2009  19:30  1040.75  1040.75  1038.50  1039.50    1803
6  09/27/2009  19:45  1039.25  1040.25  1039.25  1039.50    1308
7  09/27/2009  20:00  1039.25  1041.00  1038.00  1039.50    4617
8  09/27/2009  20:15  1039.50  1040.50  1038.75  1040.00    1679
9  09/27/2009  20:30  1039.75  1040.25  1038.25  1038.50    2885

In [4]:
df_es.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241774 entries, 0 to 241773
Data columns (total 7 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    241774 non-null  object
 1   time    241774 non-null  object
 2   open    241774 non-null  float64
 3   max     241774 non-null  float64
 4   min     241774 non-null  float64
 5   close   241774 non-null  float64
 6   volume  241774 non-null  int64
dtypes: float64(4), int64(1), object(2)
memory usage: 12.9+ MB

In [5]:
df_es['datetime_US']=pd.to_datetime(df_es[['date', 'time']].agg(' '.join, axis=1), format='%m/%d/%Y %H:%M')
df_es['datetime_EU']= df_es['datetime_US'] + pd.to_timedelta('6 h')

#df_es.drop('time_US', axis=1, inplace=True)

In [6]:
df_es

,date,time,open,max,min,close,volume,datetime_US,datetime_EU
0,09/27/2009,18:15,1043.75,1044.00,1043.50,1043.75,631,2009-09-27 18:15:00,2009-09-28 00:15:00
1,09/27/2009,18:30,1043.75,1044.00,1043.50,1043.50,177,2009-09-27 18:30:00,2009-09-28 00:30:00
2,09/27/2009,18:45,1043.75,1043.75,1043.50,1043.75,180,2009-09-27 18:45:00,2009-09-28 00:45:00
3,09/27/2009,19:00,1043.75,1043.75,1040.25,1041.50,3017,2009-09-27 19:00:00,2009-09-28 01:00:00
4,09/27/2009,19:15,1041.50,1041.50,1040.00,1040.75,1232,2009-09-27 19:15:00,2009-09-28 01:15:00
...,...,...,...,...,...,...,...,...,...
241769,09/06/2019,15:30,2983.75,2985.25,2980.75,2980.75,33006,2019-09-06 15:30:00,2019-09-06 21:30:00
241770,09/06/2019,15:45,2981.00,2981.25,2976.75,2978.75,97816,2019-09-06 15:45:00,2019-09-06 21:45:00
241771,09/06/2019,16:00,2979.00,2981.25,2978.00,2980.75,42136,2019-09-06 16:00:00,2019-09-06 22:00:00
241772,09/06/2019,16:30,2980.75,2983.00,2980.75,2982.25,4688,2019-09-06 16:30:00,2019-09-06 22:30:00
241773,09/06/2019,16:45,2982.00,2983.25,2981.50,2983.00,2727,2019-09-06 16:45:00,2019-09-06 22:45:00

In [7]:
df_es.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 241774 entries, 0 to 241773
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   date         241774 non-null  object
 1   time         241774 non-null  object
 2   open         241774 non-null  float64
 3   max          241774 non-null  float64
 4   min          241774 non-null  float64
 5   close        241774 non-null  float64
 6   volume       241774 non-null  int64
 7   datetime_US  241774 non-null  datetime64[ns]
 8   datetime_EU  241774 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(4), int64(1), object(2)
memory usage: 16.6+ MB

In [8]:
df_es.to_csv('./Data/ES_00.csv',index=False)

In [4]:
contract='es'
print(contract.upper())

ES

In [23]:
def data_input (file_input):                                # load file input and create a dataframe and validation
    pd.options.mode.chained_assignment = None           # default='warn'   This is to avoid warnings of chained-assignment
    my_df_i = pd.read_csv(file_input, skiprows=1, names=['contract', 't_ini', 't_end', 'y_ini', 'y_end', 'rng_years',
                                                         'rng_adjust', 'axis_target'],
                        dtype={'contract': str, 't_ini': str, 't_end': str, 'y_ini': int, 'y_end': int,
                               'rng_years': int, 'rng_adjust': float, 'axis_target': int})
    my_err=''
    for i in range(len(my_df_i)):
        my_df_i['contract'][i]=my_df_i['contract'][i].upper()
        if (my_df_i['contract'][i] not in ['ES', 'YM', 'NQ', 'CL']):
            my_err='contract not valid (only ES, YM, NQ or CL'
        if (my_df_i['t_ini'][i] not in ['01:00','09:00','14:00']):
            my_err='initial timetable not valid (only 01:00,09:00 or 14:00)'
        if (my_df_i['t_end'][i] not in ['09:30','18:30','22:30']):
            my_err='final timetable not valid (only 09:30,18:30 or 22:30)'
        my_ini_time = int(my_df_i['t_ini'][i][0:1]) * 100 + int(my_df_i['t_ini'][i][4:])
        my_end_time = int(my_df_i['t_end'][i][0:1]) * 100 + int(my_df_i['t_end'][i][4:])
        if (my_end_time <= my_ini_time):
            my_err = 'timetable not valid ( )'
        if (my_df_i['y_ini'][i] not in [2014, 2015, 2016, 2017, 2018, 2019, 2020]):
            my_err = 'initial year not valid (2014, 2015, 2016, 2017, 2018, 2019, 2020)'
        if (my_df_i['y_end'][i] not in [2014, 2015, 2016, 2017, 2018, 2019, 2020]):
            my_err = 'final year not valid (2014, 2015, 2016, 2017, 2018, 2019, 2020)'
        if (my_df_i['y_end'][i] < my_df_i['y_ini'][i]):
            my_err = 'final year is not valid, it mus be grater than initial year'
        if (my_df_i['rng_years'][i] not in [1, 2, 3, 4, 5]):
            my_err='years for range is not valid (only 1, 2, 3, 4, 5)'
        if (my_df_i['rng_adjust'][i] not in [0.65, 0.70, 0.75, 0.80]):
            my_err = 'the percentage for range adjustment is not valid (only 0.65, 0.70, 0.75, 0.80)'
        if (my_df_i['axis_target'][i] not in [2, 3, 4, 5]):
            my_err = 'the qty axes for target is not valid (only 2, 3, 4, 5)'

    return my_df_i, my_err

In [24]:
df, mi_error = data_input('../Input-config.csv')

In [25]:
df

  contract  t_ini  t_end  y_ini  y_end  rng_years  rng_adjust  axis_target
0       ES  09:00  18:30   2015   2019          4         0.7            2

In [22]:
mi_error

''

In [1]:
contract='ES'
time_ini='09:00'
time_end='18:30'
range_yrs='4'
range_adj='0.65'

key_config_2 = f'{contract}{time_ini[0:2]}{time_ini[3:]}{time_end[0:2]}{time_end[3:]}{range_yrs}{range_adj[2:]}'
key_config_2

'ES09001830465'